/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nmisfit <nmisfit@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/09/18 14:59:22 by nmisfit           #+#    #+#             */
/*   Updated: 2021/09/18 15:09:56 by nmisfit          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

# include "Point.hpp"

int main()
{
	std::cout << bsp(Point(7, 7), Point(11,1), Point(2,2), Point(7,3))
		<< std::endl; // внутри треугольника
	std::cout << bsp(Point(7, 7), Point(11,1), Point(2,2), Point(3,3))
		<< std::endl; // на стороне треугольника
	std::cout << bsp(Point(7, 7), Point(11,1), Point(2,2), Point(10,3))
		<< std::endl; // вне тругольника
}